config.org
#+title: Bonk's emacs config
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Basic UI config
** General conf
#+begin_src emacs-lisp

		  (setq inhibit-startup-message t)
		(setq warning-minimum-level :emergency)

		  (scroll-bar-mode -1) ; Disable visible scrollbar
		  (tool-bar-mode -1)   ; Disable the toolbar
		  (tooltip-mode -1)    ; Disable tooltips
		  (set-fringe-mode 10) ; Give some breathing room

		  (menu-bar-mode -1)   ; isable the menu bar

  ;; In Emacs 27+, package initialization occurs before `user-init-file' is
	;; loaded, but after `early-init-file'. Doom handles package initialization, so
	;; we must prevent Emacs from doing it early!
  		  ;; Set up the visible bell
		  (setq visible-bell t)
		(column-number-mode)
		(global-display-line-numbers-mode t)

		;; Disable line numbers for some modes
		(dolist (mode '(org-mode-hook
						term-mode-hook
						shell-mode-hook
						eshell-mode-hook))
		  (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

#+RESULTS:

* Package And System setup

#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))


  (setq package-check-signature nil) 
  ;; probably not necessary


  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
  (use-package use-package-ensure-system-package)

#+end_src

#+RESULTS:


** Straight.el
#+begin_src emacs-lisp
(setq straight-vc-git-default-clone-depth 1)
(setq straight-recipes-gnu-elpa-use-mirror t)
;; (setq straight-check-for-modifications '(check-on-save find-when-checking))
(setq straight-check-for-modifications nil)
(defvar bootstrap-version)
(let* ((straight-repo-dir
        (expand-file-name "straight/repos" user-emacs-directory))
       (bootstrap-file
        (concat straight-repo-dir "/straight.el/bootstrap.el"))
       (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (shell-command
     (concat
      "mkdir -p " straight-repo-dir " && "
      "git -C " straight-repo-dir " clone "
      "https://github.com/raxod502/straight.el.git && "
      "git -C " straight-repo-dir " checkout 2d407bc")))
  (load bootstrap-file nil 'nomessage))
(straight-use-package 'use-package)
;; This is a variable that has been renamed but straight still refers when
;; doing :sraight (:no-native-compile t)
(setq comp-deferred-compilation-black-list nil)
#+end_src
#+RESULTS:

* EXWM
#+begin_example emacs-lisp
(server-start)
(load-file "./exwm.el")
#+end_example
* Keybinding Configuration

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.
[[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.
[[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings
for evil-mode.

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
	:config
	(general-create-definer bonk/leader-keys
	  :keymaps '(normal insert visual emacs)
	  :prefix "SPC"
	  :global-prefix "C-SPC"))

	(bonk/leader-keys
	  "t"  '(:ignore t :which-key "toggles")
	  "tt" '(counsel-load-theme :which-key "choose theme")
	;; Window navigation
	  "h" '(evil-window-left :which-key "move to left window")
	  "l" '(evil-window-right :which-key "move to right window")
	  "j" '(evil-window-down :which-key "move to below window")
	  "k" '(evil-window-up :which-key "move to above window")

	  "H" '(evil-window-far-left :which-key "move to left window")
	  "L" '(evil-window-far-right :which-key "move to right window")
	  "J" '(evil-window-very-bottom :which-key "move to below window")
	  "K" '(evil-window-very-top :which-key "move to above window")
	;; Window Splitting
	  "v" '(evil-window-vsplit :which-key "vertical window split")
	  "s" '(evil-window-split :which-key "window split")
	  "c" '(evil-window-delete :which-key "close current window")
	;; Buffer options
	  "DD" '(kill-this-buffer :which "kills the current buffer")
	  "Vcc" '(vterm-send-C-c :which "kills current vterm process")
	  "nn" '(neotree-toggle :which "toggles neotree")
	;; Origami options
	  "oon" '(origami-open-node :which "opens current origami node")
	  "ooc" '(origami-close-node :which "closes current origami node")
	  "oO" '(origami-open-all-nodes :which "opens all origami node")
	  "oC" '(origami-close-all-nodes :which "closes all origami node")
	  "orO" '(origami-open-node-recursively :which "opens all origami node below recursively")
	  "orC" '(origami-close-node-recursively :which "closes all origami node below recursively")
	  )

  (use-package evil
	:init
	(setq evil-want-integration t)
	(setq evil-want-keybinding nil)
	(setq evil-want-C-u-scroll t)
	(setq evil-want-C-i-jump nil)
	:config
	(evil-mode 1)
	(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
	(define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

	;; Use visual line motions even outside of visual-line-mode buffers
	(evil-global-set-key 'motion "j" 'evil-next-visual-line)
	(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

	(evil-set-initial-state 'messages-buffer-mode 'normal)
	(evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
	:after evil
	:config
	(evil-collection-init))

#+end_src

* UI Configuration

** Font Configuration

#+begin_src emacs-lisp
			;; UTF-8 as default encoding

			(set-language-environment "utf-8")
			(prefer-coding-system 'utf-8)
			(setq coding-system-for-read 'utf-8)
			(setq coding-system-for-write 'utf-8)

	  (defun set-font-to-fira-code ()
		(set-face-attribute 'default nil
							:font "fira code-11"))
	  (defun my-frame-init ()
		;; eg.
		(set-face-attribute 'default nil
							:font "Mononoki Nerd Font-15"
							:slant 'italic)
		(set-face-attribute 'mode-line nil
							:font "Fira Code-11"
							:weight 'normal
							:slant 'italic)
			(load-theme 'base16-onedark t))

	  (if (daemonp)
		  (add-hook 'after-make-frame-functions
					(lambda (frame)
					  (select-frame frame)
					  (my-frame-init)))
		(my-frame-init))

			;; (C-q Tab) inserts a tab space
			(add-hook 'ess-mode-hook (lambda () (local-set-key "\t" 'self-insert-command)))
		  (load-file "./ligature.el")
		  (use-package ligature
			:load-path "."
			:config
			;; Enable the "www" ligature in every possible major mode
			(ligature-set-ligatures 't '("www"))
			;; Enable traditional ligature support in eww-mode, if the
			;; `variable-pitch' face supports it
			(ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
			;; Enable all Cascadia Code ligatures in programming modes
			(ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
												 ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
												 "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
												 "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
												 "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
												 "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
												 "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
												 "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
												 ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
												 "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
												 "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
												 "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
												 "\\\\" "://"))
			;; Enables ligature checks globally in all buffers. You can also do it
			;; per mode with `ligature-mode'.
			(global-ligature-mode t))

  #+end_src

  #+RESULTS:
  : t

** Command Log Mode

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame.  Great for live streams and screencasts!

#+begin_src emacs-lisp

	  (use-package command-log-mode
		:commands command-log-mode)

#+end_src

#+RESULTS:

** Color Theme
*** Custom Color_theme
#+begin_src emacs-lisp

#+end_src

