config.org
*** downloaded_themes
[[https://github.com/hlissner/emacs-doom-themes][doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.

#+begin_src emacs-lisp
  (use-package base16-theme)
	  (use-package doom-themes)
	  (use-package ewal-spacemacs-themes)
	  (use-package moe-theme)
	  (use-package zenburn-theme)
	  (use-package yoshi-theme)
	  (use-package sublime-themes)
	  (use-package gruvbox-theme)
	  (use-package nord-theme)
	  (use-package color-theme-sanityinc-tomorrow)
	  (use-package cyberpunk-theme)

#+end_src

#+RESULTS:

** Better Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run `M-x all-the-icons-install-fonts` so that mode line icons display correctly.

#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

#+end_src

#+RESULTS:

** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
	:defer 0
	:diminish which-key-mode
	:config
	(which-key-mode)
	(set-face-attribute 'which-key-local-map-description-face nil :font "fira code-10")
	(set-face-attribute 'which-key-key-face nil :font "fira code-10")
	(set-face-attribute 'which-key-separator-face nil :font "fira code-10")
	(set-face-attribute 'which-key-note-face nil :font "fira code-10")
	(set-face-attribute 'which-key-special-key-face nil :font "fira code-10")
	(set-face-attribute 'which-key-group-description-face nil :font "fira code-10")
	(set-face-attribute 'which-key-command-description-face nil :font "fira code-10")
	(setq which-key-idle-delay 1)
	(setq which-key-allow-imprecise-window-fit t))


#+end_src

#+RESULTS:
: t

** Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.  Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp

    (use-package ivy
      :diminish
      :bind (("C-s" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1))

    (use-package ivy-rich
      :init
      (ivy-rich-mode 1))

    (use-package counsel
      :bind (("C-M-j" . 'counsel-switch-buffer)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
      :config
      (counsel-mode 1))

#+end_src

#+RESULTS:
: counsel-minibuffer-history

** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
	:commands (helpful-callable helpful-variable helpful-command helpful-key)
	:custom
	(counsel-describe-function-function #'helpful-callable)
	(counsel-describe-variable-function #'helpful-variable)
	:bind
	([remap describe-function] . counsel-describe-function)
	([remap describe-command] . helpful-command)
	([remap describe-variable] . counsel-describe-variable)
	([remap describe-key] . helpful-key))

#+end_src

#+RESULTS:
: helpful-key

** Text Scaling

This is an example of using [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp

	  (use-package hydra
		:defer t)

	  (defhydra hydra-text-scale (:timeout 4)
		"scale text"
		("j" text-scale-increase "in")
		("k" text-scale-decrease "out")
		("f" nil "finished" :exit t))

	  (bonk/leader-keys
		"ts" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

#+RESULTS:

** Ido (tool for buffer)
   #+begin_src emacs-lisp
	 (use-package ido
	   :config
	   (ido-mode 'buffers) ;; only use this line to turn off ido for file names!
	   (setq ido-ignore-buffers '("^ " "*Completions*" "*Shell Command Output*"
								  "*Messages*" "Async Shell Command")))
   #+end_src

   #+RESULTS:
   
* Org Mode

** Basic configuration

#+begin_src emacs-lisp

	(defun bonk/org-no-line-number ()
	  (display-line-numbers-mode 0))

  (use-package org
	:straight (:no-native-compile t)
	:demand t
	:load-path "~/.emacs.d/elpa/org-9.5/"
	  :pin org
	  :commands (org-capture org-agenda)
	  :hook
	   (org-mode . bonk/org-no-line-number)
	  :config
	  (setq org-ellipsis " ▾")
	  (setq org-hide-emphasis-markers t org-emphasis-alist '((\"\$\" bold)))
	  (setq org-hide-emphasis-markers t) ;; Perhaps a bit redundant but still
	  )


#+end_src

** Better Font Faces

#+begin_src emacs-lisp

    (defun bonk/org-font-setup ()
      ;; Replace list hyphen with dot
      (font-lock-add-keywords 'org-mode
			      '(("^ *\\([-]\\) "
				 (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

      ;; Set faces for heading levels
      (dolist (face '((org-level-1 . 1.2)
		      (org-level-2 . 1.1)
		      (org-level-3 . 1.05)
		      (org-level-4 . 1.0)
		      (org-level-5 . 1.1)
		      (org-level-6 . 1.1)
		      (org-level-7 . 1.1)
		      (org-level-8 . 1.1)))
	(set-face-attribute (car face) nil :font "Sarasa Fixed Slab K"
			    :weight 'regular
			    :height (cdr face)))

      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))


#+end_src

** Nicer Heading Bullets
#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Center Org Buffers
   
#+begin_src emacs-lisp
  (defun bonk/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
		  visual-fill-column-center-text t)
	(visual-fill-column-mode 1))

  (use-package visual-fill-column
	:after org
	:hook (org-mode . bonk/org-mode-visual-fill))


#+end_src

** Auto-tangle Configuration FIles

#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun bonk/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/github/emacs-config/config.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle)))
    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bonk/org-babel-tangle-config))))

#+end_src

** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
  (use-package ob-rust)
  (use-package ob-go)
  (use-package ob-typescript)
  (with-eval-after-load 'org
	(org-babel-do-load-languages
	  'org-babel-load-languages
	  '((emacs-lisp . t)
		(python . t)
		(typescript . t)
		(go . t)
		(scheme . t)
		(rust . t)))

	(push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

* Development
** General configs

   Here is the config for wether using tabs, how to indent, how many spaces, etc.
*** Prog-mode
***** Commenting Lines
#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

***** Folding with Origami
#+begin_src emacs-lisp
  (use-package origami
	:hook (c-mode . origami-mode)
	:hook (emacs-lisp-mode . origami-mode)
	:hook (go-mode . origami-mode)
	:hook (yaml-mode . origami-mode))
#+end_src

