init.el



(use-package base16-theme)
	(use-package doom-themes)
	(use-package ewal-spacemacs-themes)
	(use-package moe-theme)
	(use-package zenburn-theme)
	(use-package yoshi-theme)
	(use-package sublime-themes)
	(use-package gruvbox-theme)
	(use-package nord-theme)
	(use-package color-theme-sanityinc-tomorrow)
	(use-package cyberpunk-theme)

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (set-face-attribute 'which-key-local-map-description-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-key-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-separator-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-note-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-special-key-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-group-description-face nil :font "Iosevka-12")
  (set-face-attribute 'which-key-command-description-face nil :font "Iosevka-12")
  (setq which-key-idle-delay 1)
  (setq which-key-allow-imprecise-window-fit t))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  (counsel-mode 1))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package hydra
  :defer t)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(bonk/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(use-package ido
  :config
  (ido-mode 'buffers) ;; only use this line to turn off ido for file names!
  (setq ido-ignore-buffers '("^ " "*Completions*" "*Shell Command Output*"
							 "*Messages*" "Async Shell Command")))

(defun bonk/org-no-line-number ()
	(display-line-numbers-mode 0))

(use-package org
  :straight (:no-native-compile t)
  :demand t
  :load-path "~/.emacs.d/elpa/org-9.5/"
    :pin org
	:commands (org-capture org-agenda)
	:hook
	 (org-mode . bonk/org-no-line-number)
	:config
	(setq org-ellipsis " ▾")
	)

(defun bonk/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
			  '(("^ *\\([-]\\) "
			 (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
		  (org-level-2 . 1.1)
		  (org-level-3 . 1.05)
		  (org-level-4 . 1.0)
		  (org-level-5 . 1.1)
		  (org-level-6 . 1.1)
		  (org-level-7 . 1.1)
		  (org-level-8 . 1.1)))
(set-face-attribute (car face) nil :font "Sarasa Fixed Slab K"
			:weight 'regular
			:height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(defun bonk/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
		visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :after org
  :hook (org-mode . bonk/org-mode-visual-fill))

;; Automatically tangle our Emacs.org config file when we save it
(defun bonk/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/github/emacs-config/config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle)))
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'bonk/org-babel-tangle-config))))

(use-package ob-rust)
(use-package ob-go)
(use-package ob-typescript)
(with-eval-after-load 'org
  (org-babel-do-load-languages
	'org-babel-load-languages
	'((emacs-lisp . t)
	  (python . t)
	  (typescript . t)
	  (go . t)
	  (rust . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package origami
  :hook (c-mode . origami-mode)
  :hook (emacs-lisp-mode . origami-mode)
  :hook (go-mode . origami-mode)
  :hook (yaml-mode . origami-mode))
