config.org
***** Infer Indent Style

#+begin_src emacs-lisp

  (defun bonk/infer-indent-style ()
	;; Honestly, This is more of a wild guess since we could be using tabs and having it wrongly
	;; configure on our ide
	(let ((space-count (how-many "^ "))
		  (tab-count (how-many "^\t")))
	  (if (> space-count tab-count )
		  (setq indent-tabs-mode nil))
	  (if (> tab-count space-count)
		  (setq indent-tabs-mode t))))

#+end_src

***** Configuration
   #+begin_src emacs-lisp
					(defun bonk/prog-mode-settings ()
					  (setq-default tab-width 4) ; I want tabs to be four spaces wide
					  (setq standard-indent 4) ; I want indent to be four spaces wide
					  (show-paren-mode t)
					  (display-line-numbers-mode)
					  (setq whitespace-style '(face tab-mark trailing))
					  (custom-set-faces
						'(whitespace-tab ((t (:foreground "#636363")))))
					  (setq whitespace-display-mappings '((tab-mark 9 [9474 9] [92 9])))
					  (setq-local show-trailing-whitespace t)
					  (bonk/infer-indent-style)
					  (whitespace-mode))

					(add-hook 'prog-mode-hook 'bonk/prog-mode-settings)
					;; Indentation levels for each lang
					(defvaralias 'js2-basic-offset 'tabwidth)
					(defvaralias 'js-indent-level 'tab-width)
					(defvaralias 'js-indent-level 'tab-width)
					(defvaralias 'rjsx-indent-level 'tab-width)
					(defvaralias 'rjsx-mode-markup-indent-offset 'tab-width)
					(defvaralias 'rjsx-mode-code-indent-offset 'tab-width)
					(defvaralias 'web-mode-css-indent-offset 'tab-width)
					(defvaralias 'js2-indent-level 'tab-width)

					;; Increase for better lsp-mode performance; see
					;; https://emacs-lsp.github.io/lsp-mode/page/performance/
					(setq gc-cons-threshold 100000000)
					(when (boundp 'read-process-output-max)
					  ;; New in Emacs 27
					  (setq read-process-output-max (* 2048 2048))
					  (load-file "./magit.el"))
   #+end_src

   #+RESULTS:
   : t

** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
	:after lsp-mode
	:hook (lsp-mode . company-mode)
	:bind (:map company-active-map
		("<tab>" . company-complete-selection))
	(:map lsp-mode-map
	  ("<tab>" . company-indent-or-complete-common))
	:config
  (setq company-lsp-cache-candidates 'auto)
	:custom
	(company-minimum-prefix-length 1)
	(company-idle-delay 0.15))

  (global-company-mode t)
  (use-package company-box
	:hook (company-mode . company-box-mode))
  (eval-after-load 'company
	'(push 'company-robe company-backends))

#+end_src
*** Company Backends
**** Golang
   #+begin_src emacs-lisp

     #+end_src

**** Ruby
     #+begin_src emacs-lisp
       (use-package company-inf-ruby
	 :after (company ruby-mode)
	 :config (add-to-list 'company-backends 'company-inf-ruby))
     #+end_src

**** JavaScript
     #+begin_src emacs-lisp

       (use-package ac-js2
	 :after (company tide js2-mode web-mode)
	 :config (add-to-list 'company-backends 'ac-js2))

     #+end_src

**** Web
     #+begin_src emacs-lisp

	;; HTML company backend
       (use-package company-web
	 :after (company web-mode)
	 :config (add-to-list 'company-backends 'company-web))
;; WIP missing CSS backend
     #+end_src

**** eLisp
     #+begin_src emacs-lisp
	   ;; Add `company-elisp' backend for elisp.
	   (add-hook 'emacs-lisp-mode-hook
				 '(lambda ()
					(require 'company-elisp)
					(push 'company-elisp company-backends)))

     #+end_src
     
** Languages

*** IDE Features with lsp-mode

**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp


  (defun bonk/lsp-mode-setup ()
	(setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
	(lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
	:ensure t
	:commands (lsp lsp-deferred)
	:hook (lsp-mode . bonk/lsp-mode-setup)
	:init
	(setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
	:config

	(add-hook 'typescript-mode-hook 'lsp)
	(add-hook 'rjsx-mode-hook 'lsp)
	(add-hook 'php-mode 'lsp)
	(add-hook 'css-mode 'lsp)
	(add-hook 'web-mode 'lsp)
	(lsp-enable-which-key-integration t)
	(setq lsp-completion-enable t)

	(setq lsp-language-id-configuration '((java-mode . "java")
										  (python-mode . "python")
										  (gfm-view-mode . "markdown")
										  (rust-mode . "rust")
										  (css-mode . "css")
										  (xml-mode . "xml")
										  (c-mode . "c")
										  (c++-mode . "cpp")
										  (objc-mode . "objective-c")
										  (web-mode . "html")
										  (html-mode . "html")
										  (sgml-mode . "html")
										  (mhtml-mode . "html")
										  (go-mode . "go")
										  (haskell-mode . "haskell")
										  (php-mode . "php")
										  (json-mode . "json")
										  (rjsx-mode . "javascript")
										  ))

	(setq lsp-diagnostics-provider :none)

	:custom
	(lsp-file-watch-threshold nil)
	(lsp-solargraph-multi-root nil)
	;; enable / disable the hints as you prefer:
	(lsp-rust-analyzer-server-display-inlay-hints t)
	(lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
	(lsp-rust-analyzer-display-chaining-hints t)
	(lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
	(lsp-rust-analyzer-display-closure-return-type-hints t)
	(lsp-rust-analyzer-display-parameter-hints nil)
	(lsp-rust-analyzer-display-reborrow-hints nil)
	)
#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more
like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning
of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (use-package lsp-ui
	:hook (lsp-mode . lsp-ui-mode)
	:custom
	(lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-doc-enable t)
	(lsp-ui-doc-position 'bottom))

#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+end_src

**** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp

	(use-package lsp-ivy
	  :after lsp)

#+end_src

*** Yasnippets
    Yasnippet automatically inserts code templates when I write a word and press the tab key.
    It predefines most of the common templates, including the dreadful =if err !\=nil { ....=

    #+begin_src emacs-lisp

			(use-package yasnippet                  ; Snippets
			  :after company
			  :config
			  (setq
			   yas-verbosity 1                      ; No need to be so verbose
			   yas-wrap-around-region t)
			  (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")

			  (with-eval-after-load 'yasnippet
				(setq yas-snippt-dirs '(yasnippet-snippets-dir)))

			  (yas-reload-all)
			  (yas-global-mode 1))

			(use-package yasnippet-snippets         ; Collection of snippets
			  :after yasnippet)
    #+end_src

*** Flycheck

    Flycheck is one of the two main packages for code checks in the background. The
    other one is Flymake. I use Flycheck because it allows me to define a custom “advanced”
    checker.
    #+begin_src emacs-lisp

			(use-package flycheck
			  :after company)
			(setq flycheck-disabled-checkers '(ruby ruby-reek ruby-rubocop ruby-rubylint yaml-ruby))

    #+end_src

*** TypeScript

This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.

#+begin_src emacs-lisp
  (use-package nvm
	:defer t)

  (use-package typescript-mode
	:mode "\\.ts\\'"
	:hook (typescript-mode . lsp-deferred))

#+end_src

*Important note!*  For =lsp-mode= to work with TypeScript (and JavaScript) you will need to install a language server on your machine.  If you have Node.js installed, the easiest way to do that is by running the following command:

#+begin_src shell :tangle no

npm install -g typescript-language-server typescript

#+end_src

This will install the [[https://github.com/theia-ide/typescript-language-server][typescript-language-server]] and the TypeScript compiler package.

*** Ruby
**** inf-ruby
     #+begin_src emacs-lisp
			  (use-package inf-ruby
				:after lsp)
     #+end_src
     
**** ruby-mode
     #+begin_src emacs-lisp
	   (use-package ruby-mode
		 :mode "\\.rb\\'"
		 :hook ((ruby-mode . lsp-deferred))
		 :config
		 (setq ruby-indent-tabs-mode t)
		 (setq ruby-indent-level tab-width))

	   (use-package enh-ruby-mode
		 :after ruby-mode
		 :config
		 (setq enh-ruby-indent-tabs-mode t))

     #+end_src

