config.org
**** robe-mode
     #+begin_src emacs-lisp
					 (use-package robe
					   :after ruby-mode)
					 (add-hook 'ruby-mode-hook 'robe-mode)
					 (eval-after-load 'company
					   '(push 'company-robe company-backends))
     #+end_src

     #+RESULTS:
     
**** Flymake
     #+begin_src emacs-lisp
		 (use-package flymake-ruby)
		 (add-hook 'ruby-mode-hook 'flymake-ruby-load)
     #+end_src

**** rspec-mode
     #+begin_src emacs-lisp
			  (use-package rspec-mode
				:after ruby-mode)
     #+end_src

     #+RESULTS:
     : t

*** Elixir

#+begin_src emacs-lisp
(use-package elixir-mode
  :ensure t
  :init  
  (add-hook 'elixir-mode-hook
            (lambda ()
              (push '(">=" . ?\u2265) prettify-symbols-alist)
              (push '("<=" . ?\u2264) prettify-symbols-alist)
              (push '("!=" . ?\u2260) prettify-symbols-alist)
              (push '("==" . ?\u2A75) prettify-symbols-alist)
              (push '("=~" . ?\u2245) prettify-symbols-alist)
              (push '("<-" . ?\u2190) prettify-symbols-alist)
              (push '("->" . ?\u2192) prettify-symbols-alist)
              (push '("<-" . ?\u2190) prettify-symbols-alist)
              (push '("|>" . ?\u25B7) prettify-symbols-alist))))
#+end_src

*** Golang
    
    #+begin_src emacs-lisp
	  (use-package go-mode
		:mode "\\.go\\'"
		:hook (go-mode . lsp-deferred)
		:config
		(add-hook 'go-mode-hook (lambda ()
								  (setq tab-width 4)))
		(add-hook 'go-mode-hook #'lsp)
		(add-hook 'before-save-hook 'gofmt-before-save)
		(defun lsp-go-install-save-hooks ()
		  (add-hook 'before-save-hook 'lsp-format-buffer t t)
		  (add-hook 'before-save-hook 'lsp-organize-imports t t))
		(add-hook 'go-mode-hook 'lsp-go-install-save-hooks)
		;; configure gopls
		(lsp-register-custom-settings
		 '(("gopls.completeUnimported" t t)
		   ("gopls.staticcheck" t t)))
		;; Start LSP Mode and YASnippet mode
		(add-hook 'go-mode-hook 'lsp-deferred)
		(add-hook 'go-mode-hook 'yas-minor-mode))

    #+end_src

*** R
**** ESS

#+begin_src emacs-lisp
  (use-package ess
	:hook ((R-mode . lsp-deferred))
	:config
	(require 'ess-r-mode))

#+end_src

*** Vlang

#+begin_src emacs-lisp
(use-package v-mode
  :straight (v-mode
             :type git
             :host github
             :repo "damon-kwok/v-mode"
             :files ("tokens" "v-mode.el"))
  :config
  :bind-keymap
  ("M-z" . v-menu)
  ("<f6>" . v-menu)
  ("C-c C-f" . v-format-buffer)
  :mode ("\\(\\.v?v\\|\\.vsh\\)$'" . 'v-mode))

  
#+end_src

*** Lispy languages
#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)
  (add-hook 'emacs-lisp-mode-hook 'company-mode)

  (use-package slime
	:ensure t
	:config
	(setq inferior-lisp-program "/usr/bin/sbcl")
	(setq slime-contribs '(slime-fancy)))

  (use-package slime-company
	:ensure t
	:init
	  (require 'company)
	  (slime-setup '(slime-fancy slime-company)))

#+end_src

**** Geiser
#+begin_src emacs-lisp
  (use-package geiser-guile
	:ensure t)
#+end_src
*** Rust

**** PreRequisites
First of all, you'll need rust installed (obviously). Afterwards, it would be a good idea to have the
rust-analyzer server running on background. You can install it by doing the following

#+begin_src shell

	$ git clone https://github.com/rust-analyzer.git
  $ cd rust-analyzer
  $ cargo xtask install --server # will install rust-analyzer into $HOME/.cargo/bin

#+end_src

By the way, it would be a good idea to check the changelog before cloning the HEAD of the repo, since
some versions might not work for every machine.

**** COMMENT Config

#+begin_src emacs-lisp
  (use-package rustic
	:ensure
	:bind (:map rustic-mode-map
				("M-j" . lsp-ui-imenu)
				("M-?" . lsp-find-references)
				("C-c C-c l" . flycheck-list-errors)
				("C-c C-c a" . lsp-execute-code-action)
				("C-c C-c r" . lsp-rename)
				("C-c C-c q" . lsp-workspace-restart)
				("C-c C-c Q" . lsp-workspace-shutdown)
				("C-c C-c s" . lsp-rust-analyzer-status)
				("C-c C-c e" . lsp-rust-analyzer-expand-macro)
				("C-c C-c d" . dap-hydra)
				("C-c C-c h" . lsp-ui-doc-glance))
	:config
	;; uncomment for less flashiness
	;; (setq lsp-eldoc-hook nil)
	;; (setq lsp-enable-symbol-highlighting nil)
	;; (setq lsp-signature-auto-activate nil)

	;; comment to disable rustfmt on save
	(setq rustic-format-on-save t)
	(add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

  (defun rk/rustic-mode-hook ()
	;; so that run C-c C-c C-r works without having to confirm, but don't try to
	;; save rust buffers that are not file visiting. Once
	;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
	;; no longer be necessary.
	(when buffer-file-name
	  (setq-local buffer-save-without-query t)));; Create / cleanup rust scratch projects quickly

  (use-package rust-playground :ensure)


  ;; -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
  ;; for Cargo.toml and other config files

  (use-package toml-mode :ensure)


  ;; -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
  ;; setting up debugging support with dap-mode (dap-mode is mainly used
  ;; for debugging in emacs, not only rust)

  (use-package exec-path-from-shell
	:ensure
	:init (exec-path-from-shell-initialize))

  (when (executable-find "lldb-mi")
	(use-package dap-mode
	  :ensure
	  :config
	  (dap-ui-mode)
	  (dap-ui-controls-mode 1)

	  (require 'dap-lldb)
	  (require 'dap-gdb-lldb)
	  ;; installs .extension/vscode
	  (dap-gdb-lldb-setup)
	  (dap-register-debug-template
	   "Rust::LLDB Run Configuration"
	   (list :type "lldb"
			 :request "launch"
			 :name "LLDB::Run"
		 :gdbpath "rust-lldb"
			 ;; uncomment if lldb-mi is not in PATH
			 ;; :lldbmipath "path/to/lldb-mi"
			 ))))
#+end_src
 
*** C/C++
#+begin_src emacs-lisp
  (use-package cuda-mode)
  (add-hook 'c-mode-hook 'lsp)
  (add-hook 'c++-mode-hook 'lsp)

  (use-package flycheck-clang-analyzer
	:ensure t
	:config
	(with-eval-after-load 'flycheck
	  (require 'flycheck-clang-analyzer)
	  (flycheck-clang-analyzer-setup)))

  (with-eval-after-load 'company
	(add-hook 'c++-mode-hook 'company-mode)
	(add-hook 'c-mode-hook 'company-mode))

  (use-package company-c-headers
	:ensure t)

  (use-package company-irony
	:ensure t
	:config
	(setq company-backends '((company-c-headers
							  company-dabbrev-code
							  company-irony))))

  (use-package irony
	:ensure t
	:config
	(add-hook 'c++-mode-hook 'irony-mode)
	(add-hook 'c-mode-hook 'irony-mode)
	(add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))

#+end_src

*** Python
#+begin_src emacs-lisp
(add-hook 'python-mode-hook 'flycheck-mode)

(with-eval-after-load 'company
    (add-hook 'python-mode-hook 'company-mode))

(use-package company-jedi
  :ensure t
  :config
    (require 'company)
    (add-to-list 'company-backends 'company-jedi))

(defun python-mode-company-init ()
  (setq-local company-backends '((company-jedi
                                  company-etags
                                  company-dabbrev-code))))

(use-package company-jedi
  :ensure t
  :config
    (require 'company)
    (add-hook 'python-mode-hook 'python-mode-company-init))
#+end_src

*** Javascript
***** Web Mode
#+begin_src emacs-lisp

  (use-package web-mode
	:mode "\\.html$'" "\\.jsx$" "\\.tsx$"
	:init
	(setq web-mode-markup-indent-offset 4)
	(setq web-mode-css-indent-offset 4)
	(setq web-mode-code-indent-offset 4))

#+end_src
***** RJSX mode
      It has all the features from js2 , and all the js files i've been using till now are .js
      files, so i don't really need to differentiate between modes
    #+begin_src emacs-lisp
			(use-package rjsx-mode
			  :mode "\\.js\\'"
			  :hook (rjsx-mode . lsp-deferred)
			  :init
			  (setq indent-tabs-mode t)
			  (setq js2-basic-offset 4))

	#+end_src
***** Node modules
#+begin_src emacs-lisp
(use-package add-node-modules-path
  :defer t
  :hook ( rjsx-mode . add-node-modules-path))
#+end_src
***** Tide
      #+begin_src emacs-lisp
		(defun setup-tide-mode()
		  "Setup function for tide."
		  (interactive)
		  (tide-setup)
		  (flycheck-mode +1)
		  (setq tide-format-options '(:tabSize 4 :indentSize 4))
		  (setq flycheck-check-syntax-automatically '(save mode-enabled)))

		  (use-package tide
			:after (rjsx-mode company flycheck)
			:hook (rjsx-mode . setup-tide-mode))

      #+end_src

***** Prettier 

  It is important to have prettier installed through npm beforehand though
  =npm install -g prettier=
    #+begin_src emacs-lisp

	  ;; (use-package prettier-js
	  ;;   :after (rjsx-mode)
	  ;;   :hook (rjsx-mode . prettier-js-mode))

	#+end_src

	#+RESULTS:

