config.org
*** Yaml
    #+begin_src emacs-lisp
	  ;; yaml-mode doesn't derive from prog-mode, but we can at least enable
	  ;; whitespace-mode and apply cleanup.
	  (use-package yaml-mode
		:after lsp-mode
		:config
		(add-hook 'yaml-mode-hook 'whitespace-mode)
		(add-hook 'yaml-mode-hook 'subword-mode))

    #+end_src
    
** Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp

  (use-package projectile
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/github")
      (setq projectile-project-search-path '("~/github")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

#+end_src

** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp

  ;; (use-package magit
    ;; :custom
    ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  ;; (use-package forge)

#+end_src

** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Terminals
** Term-mode
   =term-mode= is a built-in terminal emulator in Emacs. Because it is written in Emacs Lisp, you
   can start using it inmediately with very little configuration. If you are on Linux or macOs,
   =term-mode= is a great choice to get started because it supports fairly complex terminal applications
   (=htop=, =vim= , etc) and works pretty reliably.

   However, because it is written in ELisp, it can be slower than the other options like =vterm=.
   The speed will only be an issue if you regularly run console apps with a lot of output.

   - *line-mode*: It enables you to use normal Emacs keybindings while moving around in the terminal
     buffer ( it's similar to NORMAL mode in vim)
   - *char-mode*: It's similar to insert mode in VIM, meaning that , it allows you to write in
     the terminal buffer.

   With =evil-collection= installed, you will automatically switch to =char-mode= whenever you
   enter insert mode, and when escaping, you will return to =line-mode=.

   You can try running a terminal with =M-x term!=. :)

*** Useful key bindings:
    - =C-c C-p= / =C-c C-n= - go back and forward in the buffer's promts( also =[[= and =]\]= with
      evil-mode)
    - =C-c C-k= - Enter char-mode
    - =C-c C-j= - Return to line-mode
    - If you have =evil-collection= term-mode will work the way i mentioned before.

    #+begin_src emacs-lisp
	  (use-package term
		:commands term
		:config
		(setq explicit-shell-file-name "zsh") ;; You can change this to bash, fish, etc
		;;(setq explicit-zsh-args '()) ;; Use it to set especific shell args
		(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

   #+end_src

*** Term-mode 256color
    The =eterm-256color= package enhances the output of =term-mode= to enable handling of a
    wider range of color codes so that many popular terminal applications look as you would
    expect them to.  Keep in mind that this package requires =ncurses= to be installed on your
    machine so that it has access to the =tic= program.  Most Linux distributions come with
    this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp

  (use-package eterm-256color
	:after term
	:hook (term-mode . eterm-256color-mode))

#+end_src

** Vterm
   [[https://github.com/akermu/emacs-libvterm/][vterm]] is an improved terminal emulator package which uses a compiled native module to
   interact with the underlying terminal applications. This enables it to be much faster
   than =term-mode= and to also provide a more complete terminal emulation experience.
   Make sure that you have the [[https://github.com/akermu/emacs-libvterm/#requirements][necessary dependencies]] installed before trying to use
   =vterm= because there is a module that will need to be compiled before you can use it
   successfully.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :hook (vterm-mode . hide-mode-line-mode) ; modeline serves no purpose in vterm
    :config
    (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000)
    ;; Once vterm is dead, the vterm buffer is useless. Why keep it around? We can
    ;; spawn another if want one.
    (setq vterm-kill-buffer-on-exit t)
    (setq vterm-timer-delay 0.01))

#+end_src

*** Keybindings for opening vterm in other windows with =SPACE v +options=

#+begin_src emacs-lisp
	(bonk/leader-keys
	  "Vt" '(vterm-other-window :which-key "vterm in new window")
	  "Vb" '(vterm :which-key "open new buffer for vterm"))

#+end_src

** Shell-mode
   TBD (i'm pretty satisfied with vterm, but i could try this one day)
** Eshell

Eshell is a shell-like command interpreter implemented in Emacs Lisp. It invokes no external
processes except for those requested by the user. It is intended to be an alternative to the IELM
(see Emacs Lisp Interaction in The Emacs Editor) REPL for Emacs and with an interface similar to
command shells such as bash, zsh, rc, or 4dos.

~I took daviwil's eshell config and just changed a few details~ I actually like his content a lot and
i use his streams to learn more about emacs.
** Eshell Helpers

#+begin_src emacs-lisp
  (defun read-file (file-path)
	(with-temp-buffer
	  (insert-file-contents file-path)
	  (buffer-string)))

  (defun get-current-package-version ()
	(interactive)
	(let ((package-json-file (concat (eshell/pwd) "/package.json")))
	  (when (file-exists-p package-json-file)
		(let* ((package-json-contents (read-file package-json-file))
			   (package-json (ignore-errors (json-parse-string package-json-contents))))
		  (when package-json
			(ignore-errors (gethash "version" package-json)))))))
  (defun map-line-to-status-char (line)
	(cond ((string-match "^?\\? " line) "?")))

  (defun get-git-status-prompt ()
	(let ((status-lines (cdr (process-lines "git" "status" "--porcelain" "-b"))))
	  (seq-uniq (seq-filter 'identity (mapcar 'map-line-to-status-char status-lines)))))

  (defun get-prompt-path ()
	(let* ((current-path (eshell/pwd))
		   (git-output (shell-command-to-string "git rev-parse --show-toplevel"))
		   (has-path (not (string-match "^fatal" git-output))))
	  (if (not has-path)
		  (abbreviate-file-name current-path)
		(string-remove-prefix (file-name-directory git-output) current-path))))
#+end_src

#+RESULTS:
: get-prompt-path

** Eshell Prompt

#+begin_src emacs-lisp
;; This prompt function mostly replicates my custom zsh prompt setup
;; that is powered by github.com/denysdovhan/spaceship-prompt.
(defun eshell-prompt ()
  (let ((current-branch (magit-get-current-branch))
        (package-version (get-current-package-version)))
    (concat
     "\n"
     (propertize (system-name) 'face `(:foreground "#62aeed"))
     (propertize " at " 'face `(:foreground "white"))
     (propertize (get-prompt-path) 'face `(:foreground "#82cfd3"))
     (when current-branch
       (concat
        (propertize " • " 'face `(:foreground "white"))
        (propertize (concat " " current-branch) 'face `(:foreground "#c475f0"))))
     (when package-version
       (concat
        (propertize " @ " 'face `(:foreground "white"))
        (propertize package-version 'face `(:foreground "#e8a206"))))
     (propertize " • " 'face `(:foreground "white"))
     (propertize (format-time-string "%I:%M:%S %p") 'face `(:foreground "#5a5b7f"))
     (if (= (user-uid) 0)
         (propertize "\n#" 'face `(:foreground "red2"))
       (propertize "\nλ" 'face `(:foreground "#aece4a")))
     (propertize " " 'face `(:foreground "white")))))
#+end_src

#+RESULTS:
: eshell-prompt

** Config

#+begin_src emacs-lisp

  (defun bonks/configure-eshell ()
	;; Make sure magit is loaded
	(require 'magit)

	(require 'evil-collection-eshell)
	(evil-collection-eshell-setup)

	(use-package xterm-color)

	(push 'eshell-tramp eshell-modules-list)
	(push 'xterm-color-filter eshell-preoutput-filter-functions)
	(delq 'eshell-handle-ansi-color eshell-output-filter-functions)

	;; Save command history when commands are entered
	(add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

	(add-hook 'eshell-before-prompt-hook
			  (lambda ()
				(setq xterm-color-preserve-properties t)))

	;; Truncate buffer for performance
	(add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

	;; We want to use xterm-256color when running interactive commands
	;; in eshell but not during other times when we might be launching
	;; a shell command to gather its output.
	(add-hook 'eshell-pre-command-hook
			  (lambda () (setenv "TERM" "xterm-256color")))
	(add-hook 'eshell-post-command-hook
			  (lambda () (setenv "TERM" "dumb")))

	;; Use completion-at-point to provide completions in eshell
	(define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)

	;; Initialize the shell history
	(eshell-hist-initialize)

	(evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'consult-history)
	(evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
	(evil-normalize-keymaps)

	(setenv "PAGER" "cat")

	(setq eshell-prompt-function      'eshell-prompt
		  eshell-prompt-regexp        "^λ "
		  eshell-history-size         10000
		  eshell-buffer-maximum-lines 10000
		  eshell-hist-ignoredups t
		  eshell-highlight-prompt t
		  eshell-scroll-to-bottom-on-input t
		  eshell-prefer-lisp-functions nil))

  (use-package eshell
	:hook (eshell-first-time-mode . bonks/configure-eshell)
	:config

	(with-eval-after-load 'esh-opt
	  (setq eshell-destroy-buffer-when-process-dies t)
	  (setq eshell-visual-commands '("htop" "zsh" "vim" "nvim"))))


#+end_src

#+RESULTS:
| bonks/configure-eshell |

* File Management
** Backup-files
*** Configuration

I don't like when emacs creates backup files next to the originals, since it can be tedious
to commit changes on a project.

#+begin_src emacs-lisp
;; Backup and Autosave Directories
  (setq temporary-file-directory "~/.tmp/emacs/")
  (setq auto-save-file-name-transforms
	`((".*" ,temporary-file-directory t)))
  (setq backup-directory-alist            '((".*" . "~/.Trash")))
#+end_src

#+RESULTS:
: ((.* . ~/.Trash))

** Dired
*** Key Bindings

**** Navigation
**** Emacs / Evil
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer=
  after changing configuration (and after filesystem changes!)

**** Marking Files
- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!

**** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

