config.org
**** Power Command:
=C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer
editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

**** Deleting Files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

**** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

**** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs


*** Configuration

#+begin_src emacs-lisp

  (use-package dired
	:ensure nil
	:commands (dired dired-jump)
	:bind (("C-x C-j" . dired-jump))
	:custom ((setq insert-directory-program "gls" dired-use-ls-dired t)
			 (setq dired-listing-switches "-al --group-directories-first"))
	:config
	(evil-collection-define-key 'normal 'dired-mode-map
	  "h" 'dired-single-up-directory
	  "l" 'dired-single-buffer))

  (use-package dired-single)

  (use-package all-the-icons-dired
	:hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
	:config
	;; Doesn't work as expected!
	;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
	(setq dired-open-extensions '(("png" . "feh")
								  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
	:hook (dired-mode . dired-hide-dotfiles-mode)
	:config
	(evil-collection-define-key 'normal 'dired-mode-map
	  "H" 'dired-hide-dotfiles-mode))
 (use-package dired-rainbow
    :defer 2
    :config
    (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
    (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
    (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
    (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
    (dired-rainbow-define markdown "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
    (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
    (dired-rainbow-define media "#de751f" ("mp3" "mp4" "mkv" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
    (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
    (dired-rainbow-define log "#c17d11" ("log"))
    (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
    (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
    (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
    (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
    (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
    (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
    (dired-rainbow-define encrypted "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
    (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
    (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
    (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
    (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*"))

#+end_src

#+RESULTS:
: t

** NeoTree
*** KeyBindings

 - =n= next line, =p= previous line。
 - =SPC= or =RET= or =TAB= Open current item if it is a file. Fold/Unfold current item if it is a directory.
 - =U= Go up a directory
 - =g= Refresh
 - =A= Maximize/Minimize the NeoTree Window
 - =H= Toggle display hidden files
 - =O= Recursively open a directory
 - =C-c C-n= Create a file or create a directory if filename ends with a ‘/’
 - =C-c C-d= Delete a file or a directory.
 - =C-c C-r= Rename a file or a directory.
 - =C-c C-c= Change the root directory.
 - =C-c C-p= Copy a file or a directory.


*** Configuration

#+begin_src emacs-lisp

  (use-package neotree
	:defer t
	:custom
	(setq neo-theme (if (display-graphic-p) 'icons 'arrow)))


#+end_src

#+RESULTS:

* Org-Roam
#+begin_src emacs-lisp
  (use-package org-roam
	:after org-mode
	:straight t
	:hook
	(after-init . org-roam-mode)
	:custom
	(org-roam-directory "~/Notes/Roam/")
	(org-roam-completion-everywhere t)
	(org-roam-completion-system 'default)
	(org-roam-capture-templates
	  '(("d" "default" plain
		 #'org-roam-capture--get-point
		 "%?"
		 :file-name "%<%Y%m%d%H%M%S>-${slug}"
		 :head "#+title: ${title}\n"
		 :unnarrowed t)
		("ll" "link note" plain
		 #'org-roam-capture--get-point
		 "* %^{Link}"
		 :file-name "Inbox"
		 :olp ("Links")
		 :unnarrowed t
		 :immediate-finish)
		("lt" "link task" entry
		 #'org-roam-capture--get-point
		 "* TODO %^{Link}"
		 :file-name "Inbox"
		 :olp ("Tasks")
		 :unnarrowed t
		 :immediate-finish)))
	(org-roam-dailies-directory "Journal/")
	(org-roam-dailies-capture-templates
	  '(("d" "default" entry
		 #'org-roam-capture--get-point
		 "* %?"
		 :file-name "Journal/%<%Y-%m-%d>"
		 :head "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
		("t" "Task" entry
		 #'org-roam-capture--get-point
		 "* TODO %?\n  %U\n  %a\n  %i"
		 :file-name "Journal/%<%Y-%m-%d>"
		 :olp ("Tasks")
		 :empty-lines 1
		 :head "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
		("j" "journal" entry
		 #'org-roam-capture--get-point
		 "* %<%I:%M %p> - Journal  :journal:\n\n%?\n\n"
		 :file-name "Journal/%<%Y-%m-%d>"
		 :olp ("Log")
		 :head "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
		("l" "log entry" entry
		 #'org-roam-capture--get-point
		 "* %<%I:%M %p> - %?"
		 :file-name "Journal/%<%Y-%m-%d>"
		 :olp ("Log")
		 :head "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
		("m" "meeting" entry
		 #'org-roam-capture--get-point
		 "* %<%I:%M %p> - %^{Meeting Title}  :meetings:\n\n%?\n\n"
		 :file-name "Journal/%<%Y-%m-%d>"
		 :olp ("Log")
		 :head "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")))
	:bind (:map org-roam-mode-map
			(("C-c n l"   . org-roam)
			 ("C-c n f"   . org-roam-find-file)
			 ("C-c n d"   . org-roam-dailies-find-date)
			 ("C-c n c"   . org-roam-dailies-capture-today)
			 ("C-c n C r" . org-roam-dailies-capture-tomorrow)
			 ("C-c n t"   . org-roam-dailies-find-today)
			 ("C-c n y"   . org-roam-dailies-find-yesterday)
			 ("C-c n r"   . org-roam-dailies-find-tomorrow)
			 ("C-c n g"   . org-roam-graph))
		   :map org-mode-map
		   (("C-c n i" . org-roam-insert))
		   (("C-c n I" . org-roam-insert-immediate))))
#+end_src

#+RESULTS:

* Chats
** Discord
#+begin_src emacs-lisp

  ;; (use-package elcord
  ;; :ensure nil
  ;; 	:straight t
  ;; 	:custom
  ;; 	(elcord-display-buffer-details nil)
  ;; 	:config
  ;; 	(elcord-mode))
#+end_src

# ** Mastodon
# #+begin_src emacs-lisp
# (use-package mastodon
#   :defer t
#   :config
#   (setq mastodon-instance-url "https://mastodon.social"))
# #+end_src

* Mail Config

#+begin_src emacs-lisp
 ;; Comment this line if you don't have a email setup or if you don't want to set up any email
  (load-file "./email.el")

#+end_src

#+RESULTS:
: t

* Structure Templates
#+begin_src emacs-lisp
  (with-eval-after-load 'org
	  (require 'org-tempo)
	(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
	(add-to-list 'org-structure-template-alist '("py" . "src python"))
	(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
	(add-to-list 'org-structure-template-alist '("rb" . "src ruby"))
	(add-to-list 'org-structure-template-alist '("js" . "src javascript"))
	(add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
	(add-to-list 'org-structure-template-alist '("cpp" . "src C++")))

#+end_src

#+RESULTS:
: ((el . src emacs-lisp) (py . src python) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))
* Applications
** example config 'Some App'
#+begin_src conf-unix :tangle ~/.config/some-app/config :mkdirp yes

	value=4

#+end_src

